In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn import utils
import os

In [3]:
% matplotlib inline

In [5]:
mainpath = "C:/Users/ddela/GitHub/Gabriel-Udemy/python-ml-course/datasets" # la r delante cambia las barras inclinadas
filename = "/distributed-data/001.csv"
fullpath = os.path.join(mainpath, filename)

In [6]:
data = pd.read_csv(mainpath + filename)

In [7]:
data.head()

         Date  sulfate  nitrate  ID
0  2003-01-01      NaN      NaN   1
1  2003-01-02      NaN      NaN   1
2  2003-01-03      NaN      NaN   1
3  2003-01-04      NaN      NaN   1
4  2003-01-05      NaN      NaN   1

In [57]:
folderpath = mainpath + "/distributed-data/"
data = pd.read_csv(mainpath + "/distributed-data/001.csv")

temp_len = len(data)

for i in range(2, 333):
    filename = (str(i)).zfill(3) 
    filepath = folderpath + filename + ".csv"
    temp_file = pd.read_csv(filepath)
    
    temp_len += len(temp_file)
    
    data = pd.concat([data, temp_file], axis = 0)

In [58]:
data.shape

(772087, 4)

In [60]:
data.shape[0] == temp_len  # La longitud de los ficheros coincide con el número de filas del data set

True

## Otra versión simplificada

In [48]:
# Una versión simplificada de los comentarios de la lección 60

filesNames = os.listdir(folderpath)
completeData = pd.DataFrame()
 
for fileName in filesNames:    
    new_table = pd.read_csv(folderpath+fileName)
    completeData = pd.concat([completeData,new_table])

In [49]:
completeData.shape

(772087, 4)

## Join Data sets

In [1]:
mainpath = "C:/Users/ddela/GitHub/Gabriel-Udemy/python-ml-course/datasets" # la r delante cambia las barras inclinadas
filename = "/athletes/Medals.csv"

In [4]:
data_main = pd.read_csv(mainpath + filename, encoding = "ISO-8859-1")

In [5]:
data_main.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6

In [6]:
a = data_main["Athlete"].unique().tolist()

In [7]:
len(a)

6956

In [9]:
data_main.shape

(8618, 8)

In [10]:
filename2 = "/athletes/Athlete_Country_Map.csv"

In [11]:
data_country = pd.read_csv(mainpath + filename2, encoding = "ISO-8859-1")

In [12]:
data_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

In [16]:
len(data_country)

6970

In [18]:
data_country[data_country["Athlete"] == "Aleksandar Ciric"]

               Athlete                Country
1029  Aleksandar Ciric                 Serbia
1086  Aleksandar Ciric  Serbia and Montenegro

In [26]:
filename3 = "/athletes/Athlete_Sports_Map.csv"

In [27]:
data_sports = pd.read_csv(mainpath + filename3, encoding = "ISO-8859-1")

In [28]:
len(data_sports)

6975

In [30]:
data_sports[(data_sports["Athlete"]=="Chen Jing") | 
            (data_sports["Athlete"]=="Richard Thompson") | 
            (data_sports["Athlete"]=="Matt Ryan"
            )
           ]

               Athlete         Sport
528   Richard Thompson     Athletics
1308         Chen Jing    Volleyball
1419         Chen Jing  Table Tennis
2727         Matt Ryan        Rowing
5003         Matt Ryan    Equestrian
5691  Richard Thompson      Baseball

In [37]:
data_country_dp = data_country.drop_duplicates(subset="Athlete")

In [38]:
data_main_country = pd.merge(left = data_main, right = data_country_dp,
                            left_on = "Athlete", right_on = "Athlete")

In [39]:
data_main_country.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States

In [40]:
data_main_country.shape

(8618, 9)

In [36]:
data_main_country[data_main_country["Athlete"] == "Aleksandar Ciric"]

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
1503,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia
1504,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia and Montenegro
1505,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia
1506,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia and Montenegro
1507,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia
1508,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia and Montenegro

In [41]:
data_sports_dp = data_sports.drop_duplicates(subset = "Athlete")

In [42]:
data_final = pd.merge(left = data_main_country, right = data_sports_dp,
                     left_on = "Athlete", right_on = "Athlete")

In [43]:
data_final.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country,Sport
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States,Swimming
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States,Swimming
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States,Swimming
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States,Swimming
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States,Swimming

## Tipos de joins

In [93]:
# Mio
group["Athlete"].filter(lambda x : x.count()>1)

528      Richard Thompson
608      Gyuzel Manyurova
678        David Musulbes
721      Gyuzel Manyurova
773        David Musulbes
986        Slobodan Nikic
1014       Vanja Udovicic
1029     Aleksandar Ciric
1061     Aleksandar apic
1062          Dejan Savic
1063          Denis efik
1077    Vlada Vujasinovic
1086     Aleksandar Ciric
1120       Slobodan Nikic
1125     Aleksandar apic
1126          Dejan Savic
1127          Denis efik
1134       Vanja Udovicic
1136    Vlada Vujasinovic
1317            Chen Jing
1428            Chen Jing
2758           Matt Wells
3761           Matt Wells
5025          Iván García
5692     Richard Thompson
6786          Iván García
Name: Athlete, dtype: object